** Accumulation Clauses

   ~cl-loop~ uses special considerations for =append= and =collect=, using
   ~append~, ~nconc~, or a combination of ~push~ and ~nreverse~ depending on how
   variables are being declared and used.  ~loopy~ is currently much simpler,
   using ~push~ and ~nreverse~ when no explicitly variable is given (as in
   ~(collect some-val)~) and the using the named function otherwise.

   #+begin_src emacs-lisp
     (let ((l (number-sequence 1 100)))
       (bench-multi
         :times 1000
         :forms (("cl-loop" (cl-loop for i in l
                                     collect i))
                 ("loopy" (loopy ((list i l)
                                  (collect i)))))))
   #+end_src

   #+RESULTS:
   | Form    | x faster than next | Total runtime | # of GCs | Total GC runtime |
   |---------+--------------------+---------------+----------+------------------|
   | loopy   | 1.03               |      0.005255 |        0 |                0 |
   | cl-loop | slowest            |      0.005410 |        0 |                0 |

** Destructuring

   #+begin_src emacs-lisp
     (bench-multi
       :times 1000
       :forms (("cl-loop" (cl-loop for (i . j) in '((1 2 3) (4 5 6))
                                   collect i
                                   collect j))
               ;; NOTE: In `loopy', using "(collect i) (collect j)" would collect
               ;;       into two different implicit return variables.  If you want to
               ;;       use the same variable, you need to give it explicitly.
               ;;       Therefore, to do the same thing as `cl-loop' in this case, we
               ;;       need to use `push-into' instead of `collect'.
               ("loopy" (loopy ((list (i . j) '((1 2 3) (4 5 6)))
                                (push-into my-coll i)
                                (push-into my-coll j))
                               (return (nreverse my-coll))))))
   #+end_src

   #+RESULTS:
   | Form    | x faster than next | Total runtime | # of GCs | Total GC runtime |
   |---------+--------------------+---------------+----------+------------------|
   | loopy   | 1.02               |      0.000441 |        0 |                0 |
   | cl-loop | slowest            |      0.000450 |        0 |                0 |
